package PDFfiller_Automation.Lessons_2;

public class MathProgram1 {
    /**
     * 2. В переменной n хранится натуральное двузначное число.
     * Создайте программу, вычисляющую и выводящую на экран сумму цифр числа n.
     **/

    public static void main(String[] args) {
        int q = 21;
        int w = 8;

        long s = q + w;
        System.out.println("Result: " + s);

    }
}



